In [2]:
print ("Inteligencia Artificial e Big Data")

Inteligencia Artificial e Big Data

In [ ]:
!pip install pandas

In [3]:
import pandas as pd

In [11]:
dic = {
    "A":[1, 2, 3],
    "B":[-3, -2, -1],
    "C":[0, 10, 20]
}

label = ['1° linha', '2° linha', '3° linha']

DataFrame_01 = pd.DataFrame(dic, index = label)
print(DataFrame_01)

          A  B   C
1° linha  1 -3   0
2° linha  2 -2  10
3° linha  3 -1  20

In [9]:
DataFrame_01[["A", "B"]]

          A  B
1° linha  1 -3
2° linha  2 -2
3° linha  3 -1

In [12]:
DataFrame_01[["A", "C"]]

          A   C
1° linha  1   0
2° linha  2  10
3° linha  3  20

In [14]:
DataFrame_01["Nova Coluna"] = DataFrame_01["A"] * DataFrame_01["B"]

In [15]:
DataFrame_01

          A  B   C  Nova Coluna
1° linha  1 -3   0           -3
2° linha  2 -2  10           -4
3° linha  3 -1  20           -3

In [16]:
a = 5
a

5

In [18]:
a
DataFrame_01

          A  B   C  Nova Coluna
1° linha  1 -3   0           -3
2° linha  2 -2  10           -4
3° linha  3 -1  20           -3

In [19]:
print(a)
print(DataFrame_01)

5
          A  B   C  Nova Coluna
1° linha  1 -3   0           -3
2° linha  2 -2  10           -4
3° linha  3 -1  20           -3

In [20]:
DataFrame_01.drop("Nova Coluna", axis = 1)

          A  B   C
1° linha  1 -3   0
2° linha  2 -2  10
3° linha  3 -1  20

In [22]:
DataFrame_01.drop("Nova Coluna", axis = 1, inplace = True)

In [23]:
DataFrame_01

          A  B   C
1° linha  1 -3   0
2° linha  2 -2  10
3° linha  3 -1  20

In [24]:
DataFrame_01.loc["1° linha"]

A    1
B   -3
C    0
Name: 1° linha, dtype: int64

In [25]:
DataFrame_01.loc["3° linha"]

A     3
B    -1
C    20
Name: 3° linha, dtype: int64

In [26]:
DataFrame_01.loc[["1° linha", "3° linha"], ["A", "C"]]

          A   C
1° linha  1   0
3° linha  3  20

In [27]:
DataFrame_01.loc[["1° linha", "2° linha"], ["A", "B"]]

          A  B
1° linha  1 -3
2° linha  2 -2

In [31]:
DataFrame_01.iloc[2:3, 0:]

          A  B   C
3° linha  3 -1  20